pb66/stm32tests/emonTxshield/Src/adc.c
  /* USER CODE END ADC3_MspInit 0 */
    /* ADC3 clock enable */
    HAL_RCC_ADC34_CLK_ENABLED++;
    if(HAL_RCC_ADC34_CLK_ENABLED==1){
      __HAL_RCC_ADC34_CLK_ENABLE();
    }
  
    /**ADC3 GPIO Configuration    
    PB0     ------> ADC3_IN12 
    */
    GPIO_InitStruct.Pin = CT1_3_Pin;
    GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(CT1_3_GPIO_Port, &GPIO_InitStruct);

    /* ADC3 DMA Init */
    /* ADC3 Init */
    hdma_adc3.Instance = DMA2_Channel5;
    hdma_adc3.Init.Direction = DMA_PERIPH_TO_MEMORY;
    hdma_adc3.Init.PeriphInc = DMA_PINC_DISABLE;
    hdma_adc3.Init.MemInc = DMA_MINC_ENABLE;
    hdma_adc3.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
    hdma_adc3.Init.MemDataAlignment = DMA_MDATAALIGN_HALFWORD;
    hdma_adc3.Init.Mode = DMA_CIRCULAR;
    hdma_adc3.Init.Priority = DMA_PRIORITY_HIGH;
    if (HAL_DMA_Init(&hdma_adc3) != HAL_OK)
    {
      _Error_Handler(__FILE__, __LINE__);
    }

    __HAL_LINKDMA(adcHandle,DMA_Handle,hdma_adc3);

  /* USER CODE BEGIN ADC3_MspInit 1 */

  /* USER CODE END ADC3_MspInit 1 */
  }
  else if(adcHandle->Instance==ADC4)
  {
  /* USER CODE BEGIN ADC4_MspInit 0 */

  /* USER CODE END ADC4_MspInit 0 */
    /* ADC4 clock enable */
    HAL_RCC_ADC34_CLK_ENABLED++;
    if(HAL_RCC_ADC34_CLK_ENABLED==1){
      __HAL_RCC_ADC34_CLK_ENABLE();
    }
  
    /**ADC4 GPIO Configuration    
    PB14     ------> ADC4_IN4 
    */
    GPIO_InitStruct.Pin = VT1_Pin;
    GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(VT1_GPIO_Port, &GPIO_InitStruct);

    /* ADC4 DMA Init */
    /* ADC4 Init */
    hdma_adc4.Instance = DMA2_Channel2;
    hdma_adc4.Init.Direction = DMA_PERIPH_TO_MEMORY;
    hdma_adc4.Init.PeriphInc = DMA_PINC_DISABLE;
    hdma_adc4.Init.MemInc = DMA_MINC_ENABLE;
    hdma_adc4.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
    hdma_adc4.Init.MemDataAlignment = DMA_MDATAALIGN_HALFWORD;
    hdma_adc4.Init.Mode = DMA_CIRCULAR;
    hdma_adc4.Init.Priority = DMA_PRIORITY_HIGH;
    if (HAL_DMA_Init(&hdma_adc4) != HAL_OK)
    {
      _Error_Handler(__FILE__, __LINE__);
    }

    __HAL_LINKDMA(adcHandle,DMA_Handle,hdma_adc4);

  /* USER CODE BEGIN ADC4_MspInit 1 */

  /* USER CODE END ADC4_MspInit 1 */
  }
}

void HAL_ADC_MspDeInit(ADC_HandleTypeDef* adcHandle)
{

  if(adcHandle->Instance==ADC1)
  {
  /* USER CODE BEGIN ADC1_MspDeInit 0 */

  /* USER CODE END ADC1_MspDeInit 0 */
    /* Peripheral clock disable */
    /* Be sure that all peripheral instances that share the same clock need to be disabled */
    /**  HAL_RCC_ADC12_CLK_ENABLED--;
    *  if(HAL_RCC_ADC12_CLK_ENABLED==0){
    *    __HAL_RCC_ADC12_CLK_DISABLE();
    **/
  
    /**ADC1 GPIO Configuration    
    PC1     ------> ADC1_IN7
    PA1     ------> ADC1_IN2 
    */
    HAL_GPIO_DeInit(CT1_4_GPIO_Port, CT1_4_Pin);

    HAL_GPIO_DeInit(CT1_1_GPIO_Port, CT1_1_Pin);

    /* ADC1 DMA DeInit */
    HAL_DMA_DeInit(adcHandle->DMA_Handle);
  /* USER CODE BEGIN ADC1_MspDeInit 1 */

  /* USER CODE END ADC1_MspDeInit 1 */
  }
  else if(adcHandle->Instance==ADC2)
  {
  /* USER CODE BEGIN ADC2_MspDeInit 0 */

  /* USER CODE END ADC2_MspDeInit 0 */
    /* Peripheral clock disable */
    /* Be sure that all peripheral instances that share the same clock need to be disabled */
    /**  HAL_RCC_ADC12_CLK_ENABLED--;
    *  if(HAL_RCC_ADC12_CLK_ENABLED==0){
    *    __HAL_RCC_ADC12_CLK_DISABLE();
    **/
  
    /**ADC2 GPIO Configuration    
    PC1     ------> ADC2_IN7
    PA4     ------> ADC2_IN1 
    */
    HAL_GPIO_DeInit(CT1_4_GPIO_Port, CT1_4_Pin);

    HAL_GPIO_DeInit(CT1_2_GPIO_Port, CT1_2_Pin);

    /* ADC2 DMA DeInit */
    HAL_DMA_DeInit(adcHandle->DMA_Handle);
  /* USER CODE BEGIN ADC2_MspDeInit 1 */

  /* USER CODE END ADC2_MspDeInit 1 */
  }
  else if(adcHandle->Instance==ADC3)
  {
  /* USER CODE BEGIN ADC3_MspDeInit 0 */

  /* USER CODE END ADC3_MspDeInit 0 */
    /* Peripheral clock disable */
    /* Be sure that all peripheral instances that share the same clock need to be disabled */
    /**  HAL_RCC_ADC34_CLK_ENABLED--;
    *  if(HAL_RCC_ADC34_CLK_ENABLED==0){
    *    __HAL_RCC_ADC34_CLK_DISABLE();
    **/
  
    /**ADC3 GPIO Configuration    
    PB0     ------> ADC3_IN12 
    */
    HAL_GPIO_DeInit(CT1_3_GPIO_Port, CT1_3_Pin);

    /* ADC3 DMA DeInit */
    HAL_DMA_DeInit(adcHandle->DMA_Handle);
  /* USER CODE BEGIN ADC3_MspDeInit 1 */

  /* USER CODE END ADC3_MspDeInit 1 */
  }
  else if(adcHandle->Instance==ADC4)
  {
  /* USER CODE BEGIN ADC4_MspDeInit 0 */

  /* USER CODE END ADC4_MspDeInit 0 */
    /* Peripheral clock disable */
    /* Be sure that all peripheral instances that share the same clock need to be disabled */
    /**  HAL_RCC_ADC34_CLK_ENABLED--;
    *  if(HAL_RCC_ADC34_CLK_ENABLED==0){
    *    __HAL_RCC_ADC34_CLK_DISABLE();
    **/
  
    /**ADC4 GPIO Configuration    
    PB14     ------> ADC4_IN4 
    */
    HAL_GPIO_DeInit(VT1_GPIO_Port, VT1_Pin);

    /* ADC4 DMA DeInit */
    HAL_DMA_DeInit(adcHandle->DMA_Handle);
  /* USER CODE BEGIN ADC4_MspDeInit 1 */

  /* USER CODE END ADC4_MspDeInit 1 */
  }
} 

/* USER CODE BEGIN 1 */

//
//  Map the handle supplied by the HAL into an index we can use into our
//  datastructures.
//
static inline int handle_to_index (ADC_HandleTypeDef* hadc)
{
  if (hadc == &hadc1)
    return 0;
  if (hadc == &hadc2)
    return 1;
  if (hadc == &hadc3)
    return 2;
  return 3;
}

//
// The bulk of the ISR processing is identical whether we're half-full or full-full.
// The half Vs full distinction only impacts which half of the DMA buffer we extract from.
// The two callback routines demux that and both call here to do all the real work.
//
static inline void ConvCpltEither (ADC_HandleTypeDef* hadc, int dma_buff_index_base) {
  int adc_index;

  //
  // Ignore data for the first 10 seconds after booting, gives time
  // to arm the scope
  // 
  if ((HAL_GetTick() < 10000))
      return;

  //
  // Determine which ADC has just crossed a boundary and set up pointers to our
  // datastructures for it.
  //
  adc_index = handle_to_index(hadc);


  // 
  // We only want to cop the overhead of the for-loop dma buffer traversal once.
  // All three Current ADCs interrupt within nsecs of each other, so it doesn't
  // matter which one we choose.  Long before we get to the far end of the buffer
  // they'll have all completed... actually, they all complete before we get in here.
  // But we do support quite long delays between I and V, so it's important we don't
  // start processing the data when one of the I interrupts come in if the corresponding
  // V interrupt isn't due in for potentially msecs.  start_ADCs() has helpfully left
  // us a clue in isr_index.  It'll be set to 3 (to indicate ADC4)  when we're expecting
  // V last or we're when we're expecting all four at once (no lag), and 2 otherwise.
  // That's the one we process and we simply ignore interrupts from the remaining 3 ADCs.
  //
  if (adc_index == isr_index) {  // Voltage Vs Current, whichever comes last

    HAL_GPIO_WritePin(LD2_GPIO_Port, LD2_Pin, GPIO_PIN_RESET);   // For scope timing

    //
    // Knowing which value to get from where in the DMA buffer is all about
    // knowing how the ADC sequence slots have been configured.  In this case all
    // four have been configured for just two channels per sequence.  To
    // further complicate things, channels mostly correspond with CTs (apart from
    // the internal channels Temp and Vref) but channels are numbered from 0, while
    // CTs are numbered from 1.  Our sequence is defined as follows:
    //
    // ADC1 (buff[0]) : CT1, Temp, CT1, Temp, CT1, Temp...
    // ADC2 (buff[1]) : CT2, CT4, CT2, CT4....
    // ADC3 (buff[2]) : CT3, Vref, CT3, Vref....
    // ADC4 (buff[3]) : V1, V1, V1, V1
    //
    for (int i=0; i<SEQS_PER_HALF; i++) {
      process_VI_pair(adc_dma_buff[3][i*CHANNELS_PER_SEQ+dma_buff_index_base],  // V for Ch0 (CT1)
		      adc_dma_buff[0][i*CHANNELS_PER_SEQ+dma_buff_index_base],  // I for Ch0 (CT1)
		      0);                                                       // Chan num
      process_VI_pair(adc_dma_buff[3][i*CHANNELS_PER_SEQ+dma_buff_index_base],  // V for Ch1 (CT2)
		      adc_dma_buff[1][i*CHANNELS_PER_SEQ+dma_buff_index_base],  // I for Ch1 (CT2)
		      1);                                                       // Chan num
      process_VI_pair(adc_dma_buff[3][i*CHANNELS_PER_SEQ+dma_buff_index_base],  // V for Ch2 (CT3)
		      adc_dma_buff[2][i*CHANNELS_PER_SEQ+dma_buff_index_base],  // I for Ch2 (CT3)
		      2);                                                       // Chan num
      process_VI_pair(adc_dma_buff[3][i*CHANNELS_PER_SEQ+1+dma_buff_index_base],// V for Ch3 (CT4)
		      adc_dma_buff[1][i*CHANNELS_PER_SEQ+1+dma_buff_index_base],// I for Ch3 (CT4)
		      3);                                                       // Chan num
    }

    HAL_GPIO_WritePin(LD2_GPIO_Port, LD2_Pin, GPIO_PIN_SET);
  }
}

void HAL_ADC_ConvHalfCpltCallback(ADC_HandleTypeDef* hadc)
{
  ConvCpltEither(hadc, 0);
}

void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef* hadc)
{
  ConvCpltEither(hadc, CHANNELS_PER_SEQ*SEQS_PER_HALF);
}

