pb66/stm32tests/emonTxshield/Src/adc.c
void calibrate_ADCs (void) {

  HAL_ADCEx_Calibration_Start(&hadc1, ADC_SINGLE_ENDED);
  HAL_ADCEx_Calibration_Start(&hadc2, ADC_SINGLE_ENDED);
  HAL_ADCEx_Calibration_Start(&hadc3, ADC_SINGLE_ENDED);
  HAL_ADCEx_Calibration_Start(&hadc4, ADC_SINGLE_ENDED);
}

//
// Start all four ADCs with a lag between the Voltage ADC (ADC4)
// and the three current ADCs (ADC1-ADC3).   We achieve this with
// a one-shot PWM pulse from TIM8. The natural state of the
// timer when it's not running is HIGH, so we trigger on a negative
// pulse.   Which ever one(s) starts on the negative edge will be off
// and running early.  
//
// usec_lag > 0, Current ADCs start early, Voltage brings up the rear
// usec_lag < 0, Voltage ADC starts early, Current brings up the rear.
// usec_lag = 0, both start on same edge
//
void start_ADCs (int32_t usec_lag) {


  //
  // On the first call they will already be stopped, but in case we're
  // called multiple times to change the usec_lag, make sure they're
  // all stopped.
  //
  HAL_ADC_Stop_DMA(&hadc1);
  HAL_ADC_Stop_DMA(&hadc2);
  HAL_ADC_Stop_DMA(&hadc3);
  HAL_ADC_Stop_DMA(&hadc4);

  if (usec_lag == 0) {
    //
    // Caller has requested no lag so set them all to the same edge.
    //
    MODIFY_REG(hadc1.Instance->CFGR, ADC_CFGR_EXTEN, ADC_EXTERNALTRIGCONVEDGE_RISING);
    MODIFY_REG(hadc2.Instance->CFGR, ADC_CFGR_EXTEN, ADC_EXTERNALTRIGCONVEDGE_RISING);
    MODIFY_REG(hadc3.Instance->CFGR, ADC_CFGR_EXTEN, ADC_EXTERNALTRIGCONVEDGE_RISING);
    MODIFY_REG(hadc4.Instance->CFGR, ADC_CFGR_EXTEN, ADC_EXTERNALTRIGCONVEDGE_RISING);
    usec_lag = 1;                                         // any pulse from the timer will do 
    isr_index = 3;                                        // process ISR when V comes in


  } else if (usec_lag < 0) {
    //
    // Caller wants -ve lag, so Currents on rising, and Voltage on falling.
    //
    MODIFY_REG(hadc1.Instance->CFGR, ADC_CFGR_EXTEN, ADC_EXTERNALTRIGCONVEDGE_RISING);
    MODIFY_REG(hadc2.Instance->CFGR, ADC_CFGR_EXTEN, ADC_EXTERNALTRIGCONVEDGE_RISING);
    MODIFY_REG(hadc3.Instance->CFGR, ADC_CFGR_EXTEN, ADC_EXTERNALTRIGCONVEDGE_RISING);
    MODIFY_REG(hadc4.Instance->CFGR, ADC_CFGR_EXTEN, ADC_EXTERNALTRIGCONVEDGE_FALLING);
    usec_lag = abs(usec_lag);                             // turn it +ve for the timer
    isr_index = 2;                                        // process ISR when I comes in
  } else {
    //
    // Caller wants a +ve lag, so Currents on falling, and Voltage on rising.
    //
    MODIFY_REG(hadc1.Instance->CFGR, ADC_CFGR_EXTEN, ADC_EXTERNALTRIGCONVEDGE_FALLING);
    MODIFY_REG(hadc2.Instance->CFGR, ADC_CFGR_EXTEN, ADC_EXTERNALTRIGCONVEDGE_FALLING);
    MODIFY_REG(hadc3.Instance->CFGR, ADC_CFGR_EXTEN, ADC_EXTERNALTRIGCONVEDGE_FALLING);
    MODIFY_REG(hadc4.Instance->CFGR, ADC_CFGR_EXTEN, ADC_EXTERNALTRIGCONVEDGE_RISING);
    isr_index = 3;                                        // process ISR when V comes in
  }
  if (usec_lag > 9999) usec_lag = 9999;                   // limit of the counter/timer
  
  //
  // These PWM timers in one-shot mode are almost like a pipeline,
  // every action causes the previous action to finally happen.
  // This call stops the last pulse - by generating a pulse with whatever
  // value is set in the GUI and appears above.  We don't want the
  // ADCs to trigger on this one, and it'll take 10 msecs to complete,
  // i.e. the timer will take 10msecs to do it's thing, the call returns
  // immediately, and it makes sure the next pulse will be of the requested
  // duration.
  //
  pulse_tim8_ch2(usec_lag);
  HAL_Delay(20);

  //
  // Now the bogus one has flown through the timer, it's safe to arm the ADCs.
  // After these calls, the next edges on the timer will start them running, forever.
  // The Voltage ADC (ADC4) will start on one edge, all the rest will start on the other.
  // In the case where the caller has requested no timeshift, all four start on the
  // same edge, and the pulse duration makes no difference.
  //
  HAL_ADC_Start_DMA(&hadc1, (uint32_t*)adc_dma_buff[0], ADC_DMA_BUFFSIZE);
  HAL_ADC_Start_DMA(&hadc2, (uint32_t*)adc_dma_buff[1], ADC_DMA_BUFFSIZE);
  HAL_ADC_Start_DMA(&hadc3, (uint32_t*)adc_dma_buff[2], ADC_DMA_BUFFSIZE);
  HAL_ADC_Start_DMA(&hadc4, (uint32_t*)adc_dma_buff[3], ADC_DMA_BUFFSIZE);

  //
  // Now force the last one through (which has the correct settings) and they all
  // kick to life on the appropriate edges.
  //
  pulse_tim8_ch2(usec_lag);
}

//
// See the ADC sequence definition above (comment in ConvCplEither()) to know
// where to get these two from.  They're being sampled every time around the
// sequence and they're slow moving, so it doesn't matter which half of the
// dma buffer we sample them from.
//
int get_cpu_temp () {
  return (COMPUTATION_TEMPERATURE(adc_dma_buff[0][1]));
}

int get_vdd () {
  return (3300 * *VREF_CAL_ADDR / adc_dma_buff[2][1]);
}

//
// Diagnostic routine to dump all 4 ADC's config registers to check edge configs
//
void dump_CFGRs() {
  snprintf(log_buffer, sizeof(log_buffer), "hadc1.CFGR: %08x\n", (unsigned int)hadc1.Instance->CFGR);
  debug_printf(log_buffer);
  snprintf(log_buffer, sizeof(log_buffer), "hadc2.CFGR: %08x\n", (unsigned int)hadc2.Instance->CFGR);
  debug_printf(log_buffer);
  snprintf(log_buffer, sizeof(log_buffer), "hadc3.CFGR: %08x\n", (unsigned int)hadc3.Instance->CFGR);
  debug_printf(log_buffer);
  snprintf(log_buffer, sizeof(log_buffer), "hadc4.CFGR: %08x\n", (unsigned int)hadc4.Instance->CFGR);
  debug_printf(log_buffer);
}


/* USER CODE END 1 */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
